goods = {
    'яблоки',
    'груши',
    'апельсины',
    'красные апельсины',
    'грейпфруты',
    'мандарины',
    'помело',
    'кабачки',
    'патисоны',
    'баклажаны'
}


warehouse1 = {
    'яблоки': 10,
    'груши': 12,
    'кабачки': 5,
}
warehouse2 = {
    'яблоки': 8,
    'кабачки': 11,
    'баклажаны': 3,
}
warehouse3 = {
    'апельсины': 21,
    'красные апельсины': 3,
    'грейпфруты': 7,
    'мандарины': 10,
    'помело': 4,
}

empty = dict.fromkeys(goods, 0)
# >>> empty
# {'яблоки': 0, 'груши': 0, 'апельсины': 0, 'красные апельсины': 0, 'грейпфруты': 0, 'мандарины': 0, 'помело': 0, 'кабачки': 0, 'патисоны': 0, 'баклажаны': 0}

all_wh = (
    empty | warehouse1,
    # {'яблоки': 10, 'груши': 12, 'апельсины': 0, 'красные апельсины': 0, 'грейпфруты': 0, 'мандарины': 0, 'помело': 0, 'кабачки': 5, 'патисоны': 0, 'баклажаны': 0}
    empty | warehouse2,
    # {'яблоки': 8, 'груши': 0, 'апельсины': 0, 'красные апельсины': 0, 'грейпфруты': 0, 'мандарины': 0, 'помело': 0, 'кабачки': 11, 'патисоны': 0, 'баклажаны': 3}
    empty | warehouse3,
    # {'яблоки': 0, 'груши': 0, 'апельсины': 21, 'красные апельсины': 3, 'грейпфруты': 7, 'мандарины': 10, 'помело': 4, 'кабачки': 0, 'патисоны': 0, 'баклажаны': 0}
)

total = {}
for good in goods:
    total[good] = sum(wh[good] for wh in all_wh)

print(total)
